jj11hh/ch554_sdcc/projects/usb_cdc_spi/main.c
    }
}

void GPIOSetup( void ) {
    // Pins:
    // LED:     P3.4 Output
    // IRQ:     P3.2 Input & Interrupt
    // MOSI:    P1.5 Output
    // MISO:    P1.6 Input
    // SCK:     P1.7 Output
    // CE:      P3.1 Output
    // CSN:     P3.0 Output

    P3_DIR_PU = 0b11111011;
    P3_MOD_OC = 0b00000000;
    // Port3: 8 7 6 5 4 3 2 1 0
    // In:                0
    // Out:   1 1 1 1 1 1   1 1

    P1_DIR_PU = 0b110111111;
    P1_MOD_OC = 0b000000000;
    // Port1: 8 7 6 5 4 3 2 1 0
    // In:        0
    // Out:   1 1   1 1 1 1 1 1

    LED = 0; // LED On
    CE = 0;  // Disable TX/RX
}

void UsbCDC_Write(const char *buf, uint8_t len) {
    // write upload endpoint
    while (!UsbConfig || UpPoint2_Busy);
    memcpy(Ep2Buffer + MAX_PACKET_SIZE, buf, len);
    UEP2_T_LEN = len; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

#define UsbCDC_CountRX USBByteCount

uint8_t UsbCDC_Read(char *buf, uint8_t max) {
    uint8_t count = 0;
    if (max == 0) return 0;
    while (!UsbConfig || !UsbCDC_CountRX);
    while (UsbCDC_CountRX && max) {
        *buf = Ep2Buffer[USBBufOutPoint ++];
        buf ++;
        max --;
        UsbCDC_CountRX --;
        count ++;
    }

    if (UsbCDC_CountRX == 0)
        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;

    return count;
}

void UsbCDC_ReadUntil(char *buf, uint8_t until) {
    while (!UsbConfig || !UsbCDC_CountRX);
    while (until){
        if (UsbCDC_CountRX) {
            *buf = Ep2Buffer[USBBufOutPoint ++];
            buf ++;
            UsbCDC_CountRX --;
            until --;
            if (UsbCDC_CountRX == 0)
                UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
        }
    }
}

static inline void init() {
    CfgFsys( );                                                           // CH559 clock selection configuration
    mDelaymS(5);                                                          // Modify the main frequency and wait for the internal crystal to stabilize, which must be added
    mInitSTDIO( );                                                        // Serial port 0, can be used for debugging
    GPIOSetup();
    fsm_init();

    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               // Endpoint configuration
    USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared
  
}

//主函数
void main( void )
{
  
    init ();

    while(1)
    {
        uint8_t len;
        uint8_t i;
        __xdata uint8_t buf[32];
        len = UsbCDC_Read(buf, 32);
        for (i = 0; i < len; ++ i){
            fsm_feed(buf[i]);
        }
        fsm_poll(buf, &len);
        UsbCDC_Write(buf, len);
    }
}
